{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 224, 4], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "fused_conv2d", "class_name": "Conv2D", "config": {"name": "fused_conv2d", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "fused_re_lu", "class_name": "ReLU", "config": {"name": "fused_re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d", 0, 0, {}]]]}, {"name": "fused_conv2d_1", "class_name": "Conv2D", "config": {"name": "fused_conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu", 0, 0, {}]]]}, {"name": "fused_re_lu_1", "class_name": "ReLU", "config": {"name": "fused_re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_1", 0, 0, {}]]]}, {"name": "fused_conv2d_2", "class_name": "Conv2D", "config": {"name": "fused_conv2d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_1", 0, 0, {}]]]}, {"name": "fused_re_lu_2", "class_name": "ReLU", "config": {"name": "fused_re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_2", 0, 0, {}]]]}, {"name": "fused_conv2d_3", "class_name": "Conv2D", "config": {"name": "fused_conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_2", 0, 0, {}]]]}, {"name": "fused_re_lu_3", "class_name": "ReLU", "config": {"name": "fused_re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_3", 0, 0, {}]]]}, {"name": "fused_conv2d_4", "class_name": "Conv2D", "config": {"name": "fused_conv2d_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_3", 0, 0, {}]]]}, {"name": "fused_re_lu_4", "class_name": "ReLU", "config": {"name": "fused_re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_4", 0, 0, {}]]]}, {"name": "fused_conv2d_5", "class_name": "Conv2D", "config": {"name": "fused_conv2d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_4", 0, 0, {}]]]}, {"name": "fused_re_lu_5", "class_name": "ReLU", "config": {"name": "fused_re_lu_5", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_5", 0, 0, {}]]]}, {"name": "fused_conv2d_6", "class_name": "Conv2D", "config": {"name": "fused_conv2d_6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_5", 0, 0, {}]]]}, {"name": "fused_re_lu_6", "class_name": "ReLU", "config": {"name": "fused_re_lu_6", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_6", 0, 0, {}]]]}, {"name": "fused_conv2d_7", "class_name": "Conv2D", "config": {"name": "fused_conv2d_7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_6", 0, 0, {}]]]}, {"name": "fused_re_lu_7", "class_name": "ReLU", "config": {"name": "fused_re_lu_7", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_7", 0, 0, {}]]]}, {"name": "fused_conv2d_8", "class_name": "Conv2D", "config": {"name": "fused_conv2d_8", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_7", 0, 0, {}]]]}, {"name": "fused_conv2d_9", "class_name": "Conv2D", "config": {"name": "fused_conv2d_9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_7", 0, 0, {}]]]}, {"name": "fused_conv2d_10", "class_name": "Conv2D", "config": {"name": "fused_conv2d_10", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [4, 4], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_7", 0, 0, {}]]]}, {"name": "fused_conv2d_11", "class_name": "Conv2D", "config": {"name": "fused_conv2d_11", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [6, 6], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_7", 0, 0, {}]]]}, {"name": "fused_re_lu_8", "class_name": "ReLU", "config": {"name": "fused_re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_8", 0, 0, {}]]]}, {"name": "fused_re_lu_9", "class_name": "ReLU", "config": {"name": "fused_re_lu_9", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_9", 0, 0, {}]]]}, {"name": "fused_re_lu_10", "class_name": "ReLU", "config": {"name": "fused_re_lu_10", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_10", 0, 0, {}]]]}, {"name": "fused_re_lu_11", "class_name": "ReLU", "config": {"name": "fused_re_lu_11", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_11", 0, 0, {}]]]}, {"name": "fused_concatenate", "class_name": "Concatenate", "config": {"name": "fused_concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["fused_re_lu_8", 0, 0, {}], ["fused_re_lu_9", 0, 0, {}], ["fused_re_lu_10", 0, 0, {}], ["fused_re_lu_11", 0, 0, {}]]]}, {"name": "fused_reshape", "class_name": "Reshape", "config": {"name": "fused_reshape", "trainable": true, "dtype": "float32", "target_shape": [8, 14, 2, 2, 32]}, "inbound_nodes": [[["fused_concatenate", 0, 0, {}]]]}, {"name": "fused_permute", "class_name": "Permute", "config": {"name": "fused_permute", "trainable": true, "dtype": "float32", "dims": [1, 3, 2, 4, 5]}, "inbound_nodes": [[["fused_reshape", 0, 0, {}]]]}, {"name": "fused_reshape_1", "class_name": "Reshape", "config": {"name": "fused_reshape_1", "trainable": true, "dtype": "float32", "target_shape": [16, 28, 32]}, "inbound_nodes": [[["fused_permute", 0, 0, {}]]]}, {"name": "fused_conv2d_12", "class_name": "Conv2D", "config": {"name": "fused_conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_reshape_1", 0, 0, {}]]]}, {"name": "fused_re_lu_12", "class_name": "ReLU", "config": {"name": "fused_re_lu_12", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_12", 0, 0, {}]]]}, {"name": "fused_conv2d_13", "class_name": "Conv2D", "config": {"name": "fused_conv2d_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_12", 0, 0, {}]]]}, {"name": "fused_re_lu_13", "class_name": "ReLU", "config": {"name": "fused_re_lu_13", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_13", 0, 0, {}]]]}, {"name": "fused_add", "class_name": "Add", "config": {"name": "fused_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["fused_re_lu_13", 0, 0, {}], ["fused_re_lu_5", 0, 0, {}]]]}, {"name": "fused_reshape_2", "class_name": "Reshape", "config": {"name": "fused_reshape_2", "trainable": true, "dtype": "float32", "target_shape": [16, 28, 2, 2, 16]}, "inbound_nodes": [[["fused_add", 0, 0, {}]]]}, {"name": "fused_permute_1", "class_name": "Permute", "config": {"name": "fused_permute_1", "trainable": true, "dtype": "float32", "dims": [1, 3, 2, 4, 5]}, "inbound_nodes": [[["fused_reshape_2", 0, 0, {}]]]}, {"name": "fused_reshape_3", "class_name": "Reshape", "config": {"name": "fused_reshape_3", "trainable": true, "dtype": "float32", "target_shape": [32, 56, 16]}, "inbound_nodes": [[["fused_permute_1", 0, 0, {}]]]}, {"name": "fused_conv2d_14", "class_name": "Conv2D", "config": {"name": "fused_conv2d_14", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_reshape_3", 0, 0, {}]]]}, {"name": "fused_re_lu_14", "class_name": "ReLU", "config": {"name": "fused_re_lu_14", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_14", 0, 0, {}]]]}, {"name": "fused_conv2d_15", "class_name": "Conv2D", "config": {"name": "fused_conv2d_15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_14", 0, 0, {}]]]}, {"name": "fused_re_lu_15", "class_name": "ReLU", "config": {"name": "fused_re_lu_15", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_15", 0, 0, {}]]]}, {"name": "fused_conv2d_16", "class_name": "Conv2D", "config": {"name": "fused_conv2d_16", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fused_re_lu_15", 0, 0, {}]]]}, {"name": "fused_re_lu_16", "class_name": "ReLU", "config": {"name": "fused_re_lu_16", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "inbound_nodes": [[["fused_conv2d_16", 0, 0, {}]]]}, {"name": "fused_add_1", "class_name": "Add", "config": {"name": "fused_add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["fused_re_lu_16", 0, 0, {}], ["fused_re_lu_2", 0, 0, {}]]]}, {"name": "fused_reshape_4", "class_name": "Reshape", "config": {"name": "fused_reshape_4", "trainable": true, "dtype": "float32", "target_shape": [32, 56, 2, 2, 8]}, "inbound_nodes": [[["fused_add_1", 0, 0, {}]]]}, {"name": "fused_permute_2", "class_name": "Permute", "config": {"name": "fused_permute_2", "trainable": true, "dtype": "float32", "dims": [1, 3, 2, 4, 5]}, "inbound_nodes": [[["fused_reshape_4", 0, 0, {}]]]}, {"name": "fused_reshape_5", "class_name": "Reshape", "config": {"name": "fused_reshape_5", "trainable": true, "dtype": "float32", "target_shape": [64, 112, 8]}, "inbound_nodes": [[["fused_permute_2", 0, 0, {}]]]}, {"name": "fused_reshape_6", "class_name": "Reshape", "config": {"name": "fused_reshape_6", "trainable": true, "dtype": "float32", "target_shape": [64, 112, 2, 2, 2]}, "inbound_nodes": [[["fused_reshape_5", 0, 0, {}]]]}, {"name": "fused_permute_3", "class_name": "Permute", "config": {"name": "fused_permute_3", "trainable": true, "dtype": "float32", "dims": [1, 3, 2, 4, 5]}, "inbound_nodes": [[["fused_reshape_6", 0, 0, {}]]]}, {"name": "fused_reshape_7", "class_name": "Reshape", "config": {"name": "fused_reshape_7", "trainable": true, "dtype": "float32", "target_shape": [128, 224, 2]}, "inbound_nodes": [[["fused_permute_3", 0, 0, {}]]]}, {"name": "output", "class_name": "Softmax", "config": {"name": "output", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["fused_reshape_7", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "fused_conv2d/kernel", "shape": [3, 3, 4, 16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_1/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_1/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_10/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_10/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_11/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_11/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_12/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_12/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_13/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_13/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_14/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_14/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_15/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_15/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_16/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_16/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_2/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_4/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_5/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_6/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_6/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_7/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_7/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_8/kernel", "shape": [1, 1, 128, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_8/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_9/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "fused_conv2d_9/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}